mustafa-oztekin/STM32-Embedded-C/Thermo/Core/Src/system.c
#include <stdio.h>
#include <stdint.h>
#include "stm32f4xx.h"
#include "uart.h"
#include "system.h"

#define _STDIN	0
#define _STDOUT	1
#define _STDERR	2


UART_HandleTypeDef huart2;

///////////////////////////////////////////////////
static int _itCount = 0;
void Sys_EnterCritical(void)
{
  if (_itCount == 0)
    __disable_irq();

  ++_itCount;
}
void Sys_ExitCritical(void)
{
  if (_itCount > 0)
    --_itCount;

  if (_itCount == 0)
    __enable_irq();
}
///////////////////////////////////////////////////

void Error_Handler(void)
{
  __disable_irq();
  while (1)
  {
  }
}

void Sys_ConsoleInit(void)
{
#ifdef USING_LCD
  LCD_Init();
#else
  MX_USART2_UART_Init();
  setvbuf(stdout, NULL, _IONBF, 0);
#endif
}



void _putch(unsigned char c)
{
#ifdef USING_LCD
	LCD_Putch(c);
#else
	// UART_putch(c);
#endif
}

size_t _write(int handle, const unsigned char *buffer, size_t size)
{
	size_t nChars = 0;

	if(buffer == NULL)
		return 0;

	if(handle != _STDOUT && handle != _STDERR)
		return 0;

	while(size--) {
		_putch(*buffer++);
		++nChars;
	}

	return nChars;
}


void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  __HAL_RCC_PWR_CLK_ENABLE();
  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);

  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLM = 4;
  RCC_OscInitStruct.PLL.PLLN = 100;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
  RCC_OscInitStruct.PLL.PLLQ = 4;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV2;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_3) != HAL_OK)
  {
    Error_Handler();
  }
}



void MX_GPIO_Init(void)
{
  __HAL_RCC_GPIOH_CLK_ENABLE();
  __HAL_RCC_GPIOA_CLK_ENABLE();
  __HAL_RCC_GPIOD_CLK_ENABLE();
}

void MX_USART2_UART_Init(void)
{
  huart2.Instance = USART2;
  huart2.Init.BaudRate = 115200;
  huart2.Init.WordLength = UART_WORDLENGTH_8B;
  huart2.Init.StopBits = UART_STOPBITS_1;
  huart2.Init.Parity = UART_PARITY_NONE;
  huart2.Init.Mode = UART_MODE_TX_RX;
  huart2.Init.HwFlowCtl = UART_HWCONTROL_NONE;
  huart2.Init.OverSampling = UART_OVERSAMPLING_16;
  if (HAL_UART_Init(&huart2) != HAL_OK)
  {
    Error_Handler();
  }
}



